## Import DataFrame

In [1]:
# import libraries
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure
import numpy as np

In [2]:
# Dataset from Kaggle, includes international

nba_player_df = pd.read_csv('Datasets/Players.csv')
nba_player_df

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
...,...,...,...,...,...,...,...,...
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina

## Check for NaN or Null values

In [3]:
# check for nan 'birthstate'
number_nan_birthState = nba_player_df[['Player', 'birth_state']].isnull().values.sum()
print(f'Number of Null Values: {number_nan_birthState}')

Number of Null Values: 484

In [4]:
# drop null values
nba_player_df = nba_player_df[['Player', 'birth_state']].dropna(axis=0, how='any')
nba_player_df

                 Player             birth_state
1          Cliff Barker                 Indiana
4           Ralph Beard                Kentucky
6         Charlie Black                   Idaho
7           Nelson Bobb            Pennsylvania
8       Jake Bornheimer              New Jersey
...                 ...                     ...
3917      Troy Williams          South Carolina
3918       Kyle Wiltjer                  Oregon
3919  Stephen Zimmerman               Tennessee
3920        Paul Zipser                 Germany
3921        Ivica Zubac  Bosnia and Herzegovina

[3439 rows x 2 columns]

In [5]:
state_list = nba_player_df['birth_state'].tolist()

state_list

player_list = nba_player_df.groupby(['birth_state']).count()

player_list = player_list['Player'].tolist()
player_list

# create x-axis len for plotting
x_axis = np.arange(len(player_list))

In [6]:
# plt.bar(x_axis, player_list)
# tick_locations = [value for value in x_axis]
# plt.xticks(tick_locations, state_list, rotation='vertical')
# plt.show()

In [10]:
# Dataset from data.world, NOT inlude international

# Basketball Reference Dataset
basketball_ref_df = pd.read_excel('https://query.data.world/s/qtihzf7k3xo7dwthi75yzy55d4tirq')
# basketball_ref_df

# basketball_ref_df.loc[basketball_ref_df['Player'] == 'LeBron James']

In [8]:
# check for nan 'birthstate'
number_nan_birthState = basketball_ref_df[['Player', 'State']].isnull().values.sum()
print(f'Number of Null Values: {number_nan_birthState}')

Number of Null Values: 0

In [9]:
# drop null values
NanDrop_basketball_ref_df = basketball_ref_df[['Player', 'State']].dropna(axis=0, how='any')
NanDrop_basketball_ref_df

                Player        State
0       Michael Ansley      Alabama
1         Keith Askins      Alabama
2          Carl Bailey      Alabama
3     Charles Barkley*      Alabama
4         Eric Bledsoe      Alabama
...                ...          ...
3402    Corny Thompson  Connecticut
3403     Tyson Wheeler  Connecticut
3404   Jordan Williams  Connecticut
3405      Sly Williams  Connecticut
3406   John Williamson  Connecticut

[3407 rows x 2 columns]